In [113]:
import pandas as pd

DDL = pd.read_csv("DDL_SELECTED.csv")
SPIDER = pd.read_csv("SPIDER_SELECTED.csv", encoding='cp949')

In [114]:
SPIDER

,original_idx,db_id,query,question,query_toks,query_toks_no_value,question_toks,HAVING,ORDER BY,GROUP BY,JOIN,SELECT
0,11,department_management,SELECT count(*) FROM department WHERE departme...,How many departments are led by heads who are ...,['SELECT' 'count' '(' '*' ')' 'FROM' 'departme...,['select' 'count' '(' '*' ')' 'from' 'departme...,['How' 'many' 'departments' 'are' 'led' 'by' '...,0,0,0,0,2
1,13,department_management,SELECT T3.born_state FROM department AS T1 JOI...,List the states where both the secretary of 'T...,['SELECT' 'T3.born_state' 'FROM' 'department' ...,['select' 't3' '.' 'born_state' 'from' 'depart...,['List' 'the' 'states' 'where' 'both' 'the' 's...,0,0,0,4,2
2,14,department_management,"SELECT T1.department_id , T1.name , count(*)...",Which department has more than 1 head at a tim...,"['SELECT' 'T1.department_id' ',' 'T1.name' ','...","['select' 't1' '.' 'department_id' ',' 't1' '....",['Which' 'department' 'has' 'more' 'than' '1' ...,1,0,1,1,1
3,36,farm,SELECT T1.Official_Name\nFROM city AS T1\nJOIN...,Show the official names of the cities that hav...,['SELECT' 'T1.Official_Name' 'FROM' 'city' 'AS...,['select' 't1' '.' 'official_name' 'from' 'cit...,['Show' 'the' 'official' 'names' 'of' 'the' 'c...,1,0,1,1,1
4,37,farm,SELECT T1.Official_Name\nFROM city AS T1\nJOIN...,What are the official names of cities that hav...,['SELECT' 'T1.Official_Name' 'FROM' 'city' 'AS...,['select' 't1' '.' 'official_name' 'from' 'cit...,['What' 'are' 'the' 'official' 'names' 'of' 'c...,1,0,1,1,1
...,...,...,...,...,...,...,...,...,...,...,...,...
192,7937,dog_kennels,"SELECT T1.owner_id , T1.last_name FROM Owners...",Tell me the owner id and last name of the owne...,"['SELECT' 'T1.owner_id' ',' 'T1.last_name' 'FR...","['select' 't1' '.' 'owner_id' ',' 't1' '.' 'la...",['Tell' 'me' 'the' 'owner' 'id' 'and' 'last' '...,0,1,1,2,1
193,7940,dog_kennels,"SELECT T1.owner_id , T1.zip_code FROM Owners ...",Which owner has paid the largest amount of mon...,"['SELECT' 'T1.owner_id' ',' 'T1.zip_code' 'FRO...","['select' 't1' '.' 'owner_id' ',' 't1' '.' 'zi...",['Which' 'owner' 'has' 'paid' 'the' 'largest' ...,0,1,1,2,1
194,7941,dog_kennels,"SELECT T1.owner_id , T1.zip_code FROM Owners ...",Find the owner id and zip code of the owner wh...,"['SELECT' 'T1.owner_id' ',' 'T1.zip_code' 'FRO...","['select' 't1' '.' 'owner_id' ',' 't1' '.' 'zi...",['Find' 'the' 'owner' 'id' 'and' 'zip' 'code' ...,0,1,1,2,1
195,7954,dog_kennels,"SELECT T1.name , T2.date_of_treatment FROM Do...",List the names of the dogs of the rarest breed...,"['SELECT' 'T1.name' ',' 'T2.date_of_treatment'...","['select' 't1' '.' 'name' ',' 't2' '.' 'date_o...",['List' 'the' 'names' 'of' 'the' 'dogs' 'of' '...,0,1,1,1,2
196,7955,dog_kennels,"SELECT T1.name , T2.date_of_treatment FROM Do...",Which dogs are of the rarest breed? Show their...,"['SELECT' 'T1.name' ',' 'T2.date_of_treatment'...","['select' 't1' '.' 'name' ',' 't2' '.' 'date_o...",['Which' 'dogs' 'are' 'of' 'the' 'rarest' 'bre...,0,1,1,1,2

In [115]:
clause  = ["WHERE"]

# Function to count occurrences of each SQL clause separately and add them as individual columns
def add_sql_clause_counts(df, clauses):
    for clause in clauses:
        # Count the occurrence of each clause in each query
        df[clause] = df['query'].apply(lambda x: x.upper().count(clause))
    return df

# Apply the function to the DataFrame
SPIDER = add_sql_clause_counts(SPIDER, clause)
SPIDER.head()

,original_idx,db_id,query,question,query_toks,query_toks_no_value,question_toks,HAVING,ORDER BY,GROUP BY,JOIN,SELECT,WHERE
0,11,department_management,SELECT count(*) FROM department WHERE departme...,How many departments are led by heads who are ...,['SELECT' 'count' '(' '*' ')' 'FROM' 'departme...,['select' 'count' '(' '*' ')' 'from' 'departme...,['How' 'many' 'departments' 'are' 'led' 'by' '...,0,0,0,0,2,1
1,13,department_management,SELECT T3.born_state FROM department AS T1 JOI...,List the states where both the secretary of 'T...,['SELECT' 'T3.born_state' 'FROM' 'department' ...,['select' 't3' '.' 'born_state' 'from' 'depart...,['List' 'the' 'states' 'where' 'both' 'the' 's...,0,0,0,4,2,2
2,14,department_management,"SELECT T1.department_id , T1.name , count(*)...",Which department has more than 1 head at a tim...,"['SELECT' 'T1.department_id' ',' 'T1.name' ','...","['select' 't1' '.' 'department_id' ',' 't1' '....",['Which' 'department' 'has' 'more' 'than' '1' ...,1,0,1,1,1,0
3,36,farm,SELECT T1.Official_Name\nFROM city AS T1\nJOIN...,Show the official names of the cities that hav...,['SELECT' 'T1.Official_Name' 'FROM' 'city' 'AS...,['select' 't1' '.' 'official_name' 'from' 'cit...,['Show' 'the' 'official' 'names' 'of' 'the' 'c...,1,0,1,1,1,0
4,37,farm,SELECT T1.Official_Name\nFROM city AS T1\nJOIN...,What are the official names of cities that hav...,['SELECT' 'T1.Official_Name' 'FROM' 'city' 'AS...,['select' 't1' '.' 'official_name' 'from' 'cit...,['What' 'are' 'the' 'official' 'names' 'of' 'c...,1,0,1,1,1,0

In [116]:
SPIDER = SPIDER[['original_idx', 'db_id', 'query', 'question', 'HAVING', 'ORDER BY', 'GROUP BY', 'JOIN', 'SELECT', 'WHERE']]
SPIDER.head()

,original_idx,db_id,query,question,HAVING,ORDER BY,GROUP BY,JOIN,SELECT,WHERE
0,11,department_management,SELECT count(*) FROM department WHERE departme...,How many departments are led by heads who are ...,0,0,0,0,2,1
1,13,department_management,SELECT T3.born_state FROM department AS T1 JOI...,List the states where both the secretary of 'T...,0,0,0,4,2,2
2,14,department_management,"SELECT T1.department_id , T1.name , count(*)...",Which department has more than 1 head at a tim...,1,0,1,1,1,0
3,36,farm,SELECT T1.Official_Name\nFROM city AS T1\nJOIN...,Show the official names of the cities that hav...,1,0,1,1,1,0
4,37,farm,SELECT T1.Official_Name\nFROM city AS T1\nJOIN...,What are the official names of cities that hav...,1,0,1,1,1,0

In [118]:

# token 개수 구하는 함수
import re
def count_tokens(text):
    text = re.sub(r'\s+', ' ', text)
    return text.replace('\n',' ').split(' ')

def count_comma(row):
    return row.count(',')

# 'query' 열에 있는 각 텍스트에 대해 count_tokens 함수를 적용하여 'query_token' 열 생성
SPIDER['query_token'] = SPIDER['query'].apply(count_tokens)
SPIDER['question_token'] = SPIDER['question'].apply(count_tokens)

SPIDER['query_token_num1'] = SPIDER['query_token'].apply(len)
SPIDER['question_token_num1'] = SPIDER['question_token'].apply(len)

SPIDER['query_token_num2'] = SPIDER['query_token'].apply(count_comma)
SPIDER['question_token_num2'] = SPIDER['question_token'].apply(count_comma)


SPIDER['query_token_num'] = SPIDER['query_token_num1'] - SPIDER['query_token_num2']
SPIDER['question_token_num'] = SPIDER['question_token_num1'] - SPIDER['question_token_num2']


SPIDER.drop(columns=['query_token', 'query_token_num1', 'query_token_num2', 'question_token', 'question_token_num1', 'question_token_num2'], inplace=True)

# 결과 확인
SPIDER.head()

,original_idx,db_id,query,question,HAVING,ORDER BY,GROUP BY,JOIN,SELECT,WHERE,query_token_num,question_token_num
0,11,department_management,SELECT count(*) FROM department WHERE departme...,How many departments are led by heads who are ...,0,0,0,0,2,1,12,11
1,13,department_management,SELECT T3.born_state FROM department AS T1 JOI...,List the states where both the secretary of 'T...,0,0,0,4,2,2,54,18
2,14,department_management,"SELECT T1.department_id , T1.name , count(*)...",Which department has more than 1 head at a tim...,1,0,1,1,1,0,23,19
3,36,farm,SELECT T1.Official_Name\nFROM city AS T1\nJOIN...,Show the official names of the cities that hav...,1,0,1,1,1,0,22,14
4,37,farm,SELECT T1.Official_Name\nFROM city AS T1\nJOIN...,What are the official names of cities that hav...,1,0,1,1,1,0,22,14

In [119]:
import numpy as np

rnd = np.random.randint(0, len(SPIDER), 10)

for i in rnd:
    print(f"query : {SPIDER['query'][i]}")
    print(f"query_token : {SPIDER['query_token_num'][i]}")
    print(f"question : {SPIDER['question'][i]}")
    print(f"question_token : {SPIDER['question_token_num'][i]}")
    print("\n")

query : SELECT T2.Winery FROM GRAPES AS T1 JOIN WINE AS T2 ON T1.GRAPE  =  T2.GRAPE WHERE T1.Color  =  'White' GROUP BY T2.Winery ORDER BY count(*) DESC LIMIT 3
query_token : 27
question : Which 3 wineries produce the most wines made from white grapes?
question_token : 11


query : SELECT T3.name FROM web_client_accelerator AS T1 JOIN accelerator_compatible_browser AS T2 ON T2.accelerator_id  =  T1.id JOIN browser AS T3 ON T2.browser_id  =  T3.id WHERE T1.name  =  'CACHEbox' INTERSECT SELECT T3.name FROM web_client_accelerator AS T1 JOIN accelerator_compatible_browser AS T2 ON T2.accelerator_id  =  T1.id JOIN browser AS T3 ON T2.browser_id  =  T3.id WHERE T1.name  =  'Fasterfox'
query_token : 53
question : List the names of the browser that are compatible with both 'CACHEbox' and 'Fasterfox'.
question_token : 14


query : SELECT T1.Official_Name
FROM city AS T1
JOIN farm_competition AS T2 ON T1.City_ID = T2.Host_city_ID
GROUP BY T1.Official_Name, T2.Host_city_ID
HAVING COUNT(*) > 1;
query_token : 22
question : Show the official names of the cities that have hosted more than one competition.
question_token : 14


query : SELECT Date_Claim_Made ,  Date_Claim_Settled FROM Claims WHERE Amount_Claimed  >  ( SELECT avg(Amount_Claimed) FROM Claims )
query_token : 14
question : Give me the claim date, settlement date for all the claims whose claimed amount is larger than the average.
question_token : 19


query : SELECT t3.individual_last_name FROM organizations AS t1 JOIN organization_contact_individuals AS t2 ON t1.organization_id  =  t2.organization_id JOIN individuals AS t3 ON t2.individual_id  =  t3.individual_id WHERE t1.uk_vat_number  =  (SELECT max(uk_vat_number) FROM organizations) ORDER BY t2.date_contact_to ASC LIMIT 1
query_token : 35
question : What is the last name of the first individual contacted from the organization with the maximum UK Vat number across all organizations?
question_token : 22


query : SELECT T1.department_id ,  T1.name ,  count(*) FROM management AS T2 JOIN department AS T1 ON T1.department_id  =  T2.department_id GROUP BY T1.department_id HAVING count(*)  >  1
query_token : 23
question : Which department has more than 1 head at a time? List the id, name and the number of heads.
question_token : 19


query : SELECT T2.city FROM Customers AS T1 JOIN Addresses AS T2 ON T1.customer_address_id = T2.address_id GROUP BY T2.city ORDER BY count(*) DESC LIMIT 1;
query_token : 23
question : What is the city with the most customers?
question_token : 8


query : SELECT T2.title ,  T2.director FROM Rating AS T1 JOIN Movie AS T2 ON T1.mID  =  T2.mID WHERE T1.stars  >  (SELECT avg(T1.stars) FROM Rating AS T1 JOIN Movie AS T2 ON T1.mID  =  T2.mID WHERE T2.director  =  'James Cameron')
query_token : 37
question : What are the titles and directors of the movies whose star is greater than the average stars of the movies directed by James Cameron?
question_token : 24


query : SELECT T1.customer_details ,  T1.customer_id FROM Customers AS T1 JOIN Customer_Policies AS T2 ON T1.Customer_id  =  T2.customer_id GROUP BY T1.customer_id HAVING count(*)  >=  2 EXCEPT SELECT T1.customer_details ,  T1.customer_id FROM Customers AS T1 JOIN Customer_Policies AS T2 ON T1.Customer_id  =  T2.customer_id JOIN Claims AS T3 ON T2.policy_id  =  T3.policy_id
query_token : 46
question : Give me the the customer details and id for the customers who had two or more policies but did not file any claims.
question_token : 23


query : SELECT T1.Famous_Title FROM artist AS T1 JOIN volume AS T2 ON T1.Artist_ID  =  T2.Artist_ID WHERE T2.Weeks_on_Top  >  2 INTERSECT SELECT T1.Famous_Title FROM artist AS T1 JOIN volume AS T2 ON T1.Artist_ID  =  T2.Artist_ID WHERE T2.Weeks_on_Top  <  2
query_token : 37
question : What are the famous titles of artists who have not only had volumes that spent more than 2 weeks on top but also volumes that spent less than 2 weeks on top?
question_token : 32

In [122]:
SPIDER.to_csv("SPIDER_SELECTED.csv")